#!/usr/bin/env python3
#-*- coding: utf-8 -*-
"""завдання 4,6. Остафійчук Роман. 
Розрахунок заробітку з урахуванням понаднормових годин,
з використанням ф-ції computepay()"""


def computepay(h, r):
    # Логіка розрахунку всередині функції
    if h > 40:
        p = (40 * r) + ((h - 40) * (r * 1.5))
    else:
        p = h * r
    return p # Повертаємо результат розрахунку

# Отримуємо дані від користувача
try:
    hrs = float(input("Введіть кількість годин: "))
    rate = float(input("Введіть оплату за годину: "))

    # Викликаємо функцію та зберігаємо результат у змінну
    pay = computepay(hrs, rate)

    print("Заробіток:", pay)

except ValueError:
    print("Помилка: введіть числове значення")
